{
  "after-yang-2021": {
    "title": "After Yang",
    "poster": "after-yang-2021.jpg",
    "year": 2021,
    "viewings": [
      {
        "date": "2023-02-04",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 11,
    "comment": "Nice visuals and aesthetic. To quote a Rotten Tomatoes review, \"a very long ASMR video.\" The slow pace is fine, but it also felt like not much really happened, and I wasn't able to get into it nearly as much as others such as Drive My Car. The scenes in the vehicle also felt very repetitive."
  },
  "aftersun-2022": {
    "title": "Aftersun",
    "poster": "aftersun-2022.jpg",
    "year": 2022,
    "viewings": [
      {
        "date": "2023-02-17",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 14,
    "comment": "Interesting film, but I felt like some of it didn't connect as well with me as it should have. The MiniDV camera footage was a nice element."
  },
  "bad-axe-2022": {
    "title": "Bad Axe",
    "poster": "bad-axe-2022.jpg",
    "year": 2022,
    "viewings": [
      {
        "date": "2023-03-16",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 17,
    "comment": "This film is a touching look into the life of an Asian-American family during the pandemic. We had a discussion with filmmaker David Siev in Cornell Cinema after the screening. It was wild going from seeing David in his videos to David in real life. I think many people would benefit from watching their story."
  },
  "barbie-2023": {
    "title": "Barbie",
    "poster": "barbie-2023.jpg",
    "year": 2023,
    "viewings": [
      {
        "date": "2023-08-08",
        "location": "Landmark Greenwood Village"
      }
    ],
    "rating": 17,
    "comment": "I am Kenough"
  },
  "black-panther-wakanda-forever-2022": {
    "title": "Black Panther: Wakanda Forever",
    "poster": "black-panther-wakanda-forever-2022.jpg",
    "year": 2022,
    "viewings": [
      {
        "date": "2023-05-03",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 12,
    "comment": "Third superhero film watched in recent memory. Black Panther was new to me so I didn't understand some of the film's premise at the start. It was okay, but I liked the previous two more."
  },
  "cloud-atlas-2012": {
    "title": "Cloud Atlas",
    "poster": "cloud-atlas-2012.jpg",
    "year": 2012,
    "viewings": [
      {
        "date": "2020-01-20",
        "location": "Local"
      },
      {
        "date": "2020-05-30",
        "location": "Local"
      }
    ],
    "rating": 16,
    "comment": "\"Welcome to Papa Song's.\" The Cloud Atlas book and film are both worth a read/watch. I read the book first, and it captured things that the movie couldn't, such as the language differences in how each story is written. It's cool to see Cloud Atlas references in places I least expect it, such as code documentation..."
  },
  "decision-leave-2022": {
    "title": "Decision to Leave",
    "poster": "decision-leave-2022.jpg",
    "year": 2022,
    "viewings": [
      {
        "date": "2023-02-11",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 18,
    "comment": "Decision to Leave is a really good neo-noir romantic mystery with some superb camera work that I've never seen before. It's dark and suspenseful but still has humor in the right places. The story is clear and easy to understand at a surface level, providing for easy viewing, while also having a lot of subtle meaning behind everything."
  },
  "doctor-strange-multiverse-madness-2022": {
    "title": "Doctor Strange in the Multiverse of Madness",
    "poster": "doctor-strange-multiverse-madness-2022.jpg",
    "year": 2022,
    "viewings": [
      {
        "date": "2022-08-26",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 14,
    "comment": "Second superhero film watched in recent memory. Last saw Doctor Strange in Spider-Man in 2021. I was less invested in this one and didn't think it was quite as good, but still not bad."
  },
  "drive-my-car-2021": {
    "title": "Drive My Car",
    "poster": "drive-my-car-2021.jpg",
    "year": 2021,
    "viewings": [
      {
        "date": "2022-04-29",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 19,
    "comment": "Drive My Car was the first film that I watched independently at Cornell Cinema. The film is approximately three hours long and sometimes it feels like there's not much going on. But that's part of the beauty of it, you just need to get on the same wavelength and appreciate the meaningful silence."
  },
  "encanto-2021": {
    "title": "Encanto",
    "poster": "encanto-2021.jpg",
    "year": 2021,
    "viewings": [
      {
        "date": "2022-02-26",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 20,
    "comment": "Encanto was my first visit to Cornell Cinema and it introduced me to how amazing and special that place is. Encanto itself is an amazing animated movie with a great message. The soundtrack, of course, is also terrific. Definitely one of my favorites with how long it stayed in my head."
  },
  "oppenheimer-2023": {
    "title": "Oppenheimer",
    "poster": "oppenheimer-2023.jpg",
    "year": 2023,
    "viewings": [
      {
        "date": "2023-08-01",
        "location": "Landmark Greenwood Village"
      }
    ],
    "rating": 15,
    "comment": "Solid historical drama, but not particularly memorable for me. I found Barbie better. I also missed the first part of this film, which may have been a contributing factor."
  },
  "shang-chi-legend-ten-rings-2021": {
    "title": "Shang-Chi and the Legend of the Ten Rings",
    "poster": "shang-chi-legend-ten-rings-2021.jpg",
    "year": 2021,
    "viewings": [
      {
        "date": "2023-07-12",
        "location": "United Airlines"
      }
    ],
    "rating": 18,
    "comment": "Fourth superhero film watched in recent memory. I meant to watch it on another flight in the past but didn't for whatever reason. The family dynamics and characters felt deep and complex. Katy felt like someone I could have known in my life. The BMW product placement stuck out too much though. GM's in Barbie was much more natural."
  },
  "spider-man-no-way-home-2021": {
    "title": "Spider-Man: No Way Home",
    "poster": "spider-man-no-way-home-2021.jpg",
    "year": 2021,
    "viewings": [
      {
        "date": "2021-12-23",
        "location": "Landmark Greenwood Village"
      }
    ],
    "rating": 19,
    "comment": "This was the first superhero film that I had watched in maybe over five years. Spider-Man made me appreciate them much more and seek them out in the future. Tom Holland, Zendaya, and Jacob Batalon were great together. I didn't have much knowledge about the Spider-Man franchise going in, but was still able to enjoy the film a tremendous amount. The characters were very relatable."
  },
  "tampopo-1985": {
    "title": "Tampopo",
    "poster": "tampopo-1985.png",
    "year": 1985,
    "viewings": [
      {
        "date": "2022-07-21",
        "location": "SIFF Film Center"
      },
      {
        "date": "2022-11-07",
        "location": "Rockefeller Hall"
      }
    ],
    "rating": 20,
    "comment": "My first viewing of Tampopo was when a fellow intern rented out the SIFF Film Center to share his love of the film with everyone. Then I started to share the film with other people. The well-executed absurd comedy in Tampopo demonstrates how humor transcends both language and time."
  },
  "the-bridge-river-kwai-1957": {
    "title": "The Bridge on the River Kwai",
    "poster": "the-bridge-river-kwai-1957.jpg",
    "year": 1957,
    "viewings": [
      {
        "date": "2023-03-11",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 16,
    "comment": "The Bridge on the River Kwai is the oldest film I have seen in a while, and it felt that way. Fun to take at face value as an entertaining war movie, while also having more depth to it. Not completely historically accurate, but that's not unexpected."
  },
  "the-conformist-1970": {
    "title": "The Conformist",
    "poster": "the-conformist-1970.jpg",
    "year": 1970,
    "viewings": [
      {
        "date": "2023-03-18",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 17,
    "comment": "The Conformist (Il conformista) feels modern and classic at the same time. The architecture and visual style of the film create a fitting atmosphere for the time period. It's good."
  },
  "the-fabelmans-2022": {
    "title": "The Fabelmans",
    "poster": "the-fabelmans-2022.jpg",
    "year": 2022,
    "viewings": [
      {
        "date": "2023-04-27",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 15,
    "comment": "Nice semi-autobiographical coming of age story by Steven Spielberg. Cool to see America as he remembered it in the 1950s."
  }
}
