{
  "1917-2019": {
    "title": "1917",
    "poster": "1917-2019.jpg",
    "year": 2019,
    "viewings": [
      {
        "date": "2021-12-18",
        "location": "American Airlines"
      }
    ],
    "rating": 17,
    "comment": "1917 is a good war movie, probably one of the best I've watched. The filming effect of making it look like a few super long continous takes really helps it stand out. Kind of heavy for watching on in-flight entertainment though, so I watched less serious films on planes in the future."
  },
  "after-yang-2021": {
    "title": "After Yang",
    "poster": "after-yang-2021.jpg",
    "year": 2021,
    "viewings": [
      {
        "date": "2023-02-04",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 11,
    "comment": "Nice visuals and aesthetic. To quote a Rotten Tomatoes review, \"a very long ASMR video.\" The slow pace is fine, but it also felt like not much really happened, and I wasn't able to get into it nearly as much as others such as Drive My Car. The scenes in the vehicle also felt very repetitive."
  },
  "aftersun-2022": {
    "title": "Aftersun",
    "poster": "aftersun-2022.jpg",
    "year": 2022,
    "viewings": [
      {
        "date": "2023-02-17",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 14,
    "comment": "Interesting film, but I felt like some of it didn't connect as well with me as it should have. The MiniDV camera footage was a nice element."
  },
  "baby-driver-2017": {
    "title": "Baby Driver",
    "poster": "baby-driver-2017.jpg",
    "year": 2017,
    "viewings": [
      {
        "date": "2025-01-05",
        "location": "Delta Air Lines"
      }
    ],
    "rating": 16,
    "comment": "Baby Driver was a film I had been interested in for a while, but hadn't gotten around to seeing. The story is well made and very intense, maybe a little too much for sleepy airplane me. The immersive movie had me wondering what was going to happen next in a way other films haven't recently. The way music was incorporated in scenes was cool and the characters were fleshed out nicely. The genre of music was different than in my mind but that's probably because I watched the Deja Vu edit too many times before seeing the original. Wish the movie had more about cars."
  },
  "bad-axe-2022": {
    "title": "Bad Axe",
    "poster": "bad-axe-2022.jpg",
    "year": 2022,
    "viewings": [
      {
        "date": "2023-03-16",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 17,
    "comment": "This film is a touching look into the life of an Asian-American family during the pandemic. We had a discussion with filmmaker David Siev in Cornell Cinema after the screening. It was wild going from seeing David in his videos to David in real life. I think many people would benefit from watching their story."
  },
  "barbie-2023": {
    "title": "Barbie",
    "poster": "barbie-2023.jpg",
    "year": 2023,
    "viewings": [
      {
        "date": "2023-08-08",
        "location": "Landmark Greenwood Village"
      }
    ],
    "rating": 17,
    "comment": "I am Kenough"
  },
  "black-panther-wakanda-forever-2022": {
    "title": "Black Panther: Wakanda Forever",
    "poster": "black-panther-wakanda-forever-2022.jpg",
    "year": 2022,
    "viewings": [
      {
        "date": "2023-05-03",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 12,
    "comment": "Third superhero film watched in recent memory. Black Panther was new to me so I didn't understand some of the film's premise at the start. It was okay, but I liked the previous two more."
  },
  "booksmart-2019": {
    "title": "Booksmart",
    "poster": "booksmart-2019.jpg",
    "year": 2019,
    "viewings": [
      {
        "date": "2022-05-28",
        "location": "United Airlines"
      }
    ],
    "rating": 16,
    "comment": "Booksmart is a hilarious comedy set at the end of high school, with two girls that want to prove that they are cool and didn't just focus on school. I liked how it broke classic stereotypes and portrayed the social students as also being high achievers. People in real life don't exclusively fit into categories such as 'nerd' or 'jock'. This movie also has special personal significance because the characters were the same graduating year as me."
  },
  "borat-2006": {
    "title": "Borat",
    "poster": "borat-2006.jpg",
    "year": 2006,
    "viewings": [
      {
        "date": "2020-10-31",
        "location": "Home"
      }
    ],
    "rating": 11,
    "comment": "Borat was underwhelming for me personally. Some parts were just uncomfortable and others felt like they have not aged well. Maybe it would have made more sense in 2006, but many years later some of the political jokes don't connect. Other parts are charming though."
  },
  "borat-subsequent-moviefilm-2020": {
    "title": "Borat Subsequent Moviefilm",
    "poster": "borat-subsequent-moviefilm-2020.jpg",
    "year": 2020,
    "viewings": [
      {
        "date": "2020-11-01",
        "location": "Home"
      }
    ],
    "rating": 14,
    "comment": "Watching Borat 2 when it was released during the COVID-19 pandemic and before the 2020 US elections felt appropriate. I believe that if I were to watch for the first time it in the future instead, it wouldn't have been as good. 2020 was a year that I experienced and understood culturally."
  },
  "boyz-hood-1991": {
    "title": "Boyz n the Hood",
    "poster": "boyz-hood-1991.jpg",
    "year": 1991,
    "viewings": [
      {
        "date": "2022-01-24",
        "location": "Home"
      }
    ],
    "rating": 18,
    "comment": "Boyz n the Hood is a very important film to watch, as it draws from the director's life growing up in the hood and presents it with depth and compassion to those who may be unfamiliar with that reality. Certain scenes stood out to me, like when Furious explained gentrification of the neighborhood."
  },
  "cloud-atlas-2012": {
    "title": "Cloud Atlas",
    "poster": "cloud-atlas-2012.jpg",
    "year": 2012,
    "viewings": [
      {
        "date": "2020-01-20",
        "location": "Home"
      },
      {
        "date": "2020-05-30",
        "location": "Home"
      }
    ],
    "rating": 16,
    "comment": "\"Welcome to Papa Song's.\" The Cloud Atlas book and film are both worth a read/watch. I read the book first, and it captured things that the movie couldn't, such as the language differences in how each story is written. It's cool to see Cloud Atlas references in places I least expect it, such as code documentation..."
  },
  "coda-2021": {
    "title": "CODA",
    "poster": "coda-2021.jpg",
    "year": 2021,
    "viewings": [
      {
        "date": "2023-12-03",
        "location": "Home"
      }
    ],
    "rating": 16,
    "comment": "CODA is an interesting blend of serious topics and lighthearted comedy. If watched at a surface level, people might not think too much about the nuances of being in a deaf family. Dive a little deeper, and there's a big conversation in the world of accessibility to be had. For deaf people, aspects of their lives are expressed in familiar ways. Hearing children have to translate things possibily inappropriate for them to their parents, and community meetings without translators are difficult to understand. In any case, CODA helps people learn about the deaf community and works to normalize people with disabilities in media."
  },
  "creed-2015": {
    "title": "Creed",
    "poster": "creed-2015.jpg",
    "year": 2015,
    "viewings": [
      {
        "date": "2026-01-06",
        "location": "Alaska Airlines"
      }
    ],
    "rating": 16,
    "comment": "Heard about Creed for the first time when Creed III came out, and it took me a couple years to get around to watching any of them. I wanted to begin with the first film, so I jumped on the chance when I found it on the in-flight entertainment. Even without knowing too much about boxing myself, I still enjoyed the story and found it unique with how Adonis left his life of privilege rather than being rags to riches. Some scenes had nice humor to them. The film was good, but also somewhat predictable."
  },
  "decision-leave-2022": {
    "title": "Decision to Leave",
    "poster": "decision-leave-2022.jpg",
    "year": 2022,
    "viewings": [
      {
        "date": "2023-02-11",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 18,
    "comment": "Decision to Leave is a really good neo-noir romantic mystery with some superb camera work that I've never seen before. It's dark and suspenseful but still has humor in the right places. The story is clear and easy to understand at a surface level, providing for easy viewing, while also having a lot of subtle meaning behind everything."
  },
  "doctor-strange-multiverse-madness-2022": {
    "title": "Doctor Strange in the Multiverse of Madness",
    "poster": "doctor-strange-multiverse-madness-2022.jpg",
    "year": 2022,
    "viewings": [
      {
        "date": "2022-08-26",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 14,
    "comment": "Second superhero film watched in recent memory. Last saw Doctor Strange in Spider-Man in 2021. I was less invested in this one and didn't think it was quite as good, but still not bad."
  },
  "drive-my-car-2021": {
    "title": "Drive My Car",
    "poster": "drive-my-car-2021.jpg",
    "year": 2021,
    "viewings": [
      {
        "date": "2022-04-29",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 19,
    "comment": "Drive My Car was the first film that I watched independently at Cornell Cinema. The film is approximately three hours long and sometimes it feels like there's not much going on. But that's part of the beauty of it, you just need to get on the same wavelength and appreciate the meaningful silence."
  },
  "easy-a-2010": {
    "title": "Easy A",
    "poster": "easy-a-2010.jpg",
    "year": 2010,
    "viewings": [
      {
        "date": "2021-01-23",
        "location": "American Airlines"
      }
    ],
    "rating": 15,
    "comment": "Fun, lighthearted high school comedy. Surprised me how much I enjoyed it. Easy A does feel quite a bit older than Booksmart, but it is from a previous era. Credits music is good. The movie can feel cheesy but in a good way."
  },
  "encanto-2021": {
    "title": "Encanto",
    "poster": "encanto-2021.jpg",
    "year": 2021,
    "viewings": [
      {
        "date": "2022-02-26",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 20,
    "comment": "Encanto was my first visit to Cornell Cinema and it introduced me to how amazing and special that place is. Encanto itself is an amazing animated movie with a great message. The soundtrack, of course, is also terrific. Definitely one of my favorites with how long it stayed in my head."
  },
  "heat-1995": {
    "title": "Heat",
    "poster": "heat-1995.jpg",
    "year": 1995,
    "viewings": [
      {
        "date": "2023-07-09",
        "location": "Home"
      }
    ],
    "rating": 16,
    "comment": "Heat was a highly influential crime film, and perhaps I overhyped it a little too much before watching. It was cool to see the original robbery of the armored transport and of the bank in the middle part of the film, as they were sources of inspiration for other media I have enjoyed."
  },
  "moana-2-2024": {
    "title": "Moana 2",
    "poster": "moana-2-2024.jpg",
    "year": 2024,
    "viewings": [
      {
        "date": "2025-01-02",
        "location": "AMC Highlands Ranch 24"
      }
    ],
    "rating": 16,
    "comment": "Having enjoyed Moana 1 a lot, I was excited to finally see Moana 2. The film was good and I think the action was improved, but the original movie is still more iconic. It had a better story and soundtrack and felt less forced than the second one. Happy endings where everything's wrapped up satisfactorily are always pleasing."
  },
  "office-space-1999": {
    "title": "Office Space",
    "poster": "office-space-1999.jpg",
    "year": 1999,
    "viewings": [
      {
        "date": "2026-02-13",
        "location": "Work"
      }
    ],
    "rating": 15,
    "comment": "Fitting movie to watch at work, and still relatable nearly 27 years later even though the environment and objects found in tech company offices are much different now. Repetition of the same phrases over and over again is used very well. Office Space is important to see because it's a cult classic and there are cultural references to this movie everywhere, even in video games such as Team Fortress 2."
  },
  "oppenheimer-2023": {
    "title": "Oppenheimer",
    "poster": "oppenheimer-2023.jpg",
    "year": 2023,
    "viewings": [
      {
        "date": "2023-08-01",
        "location": "Landmark Greenwood Village"
      }
    ],
    "rating": 15,
    "comment": "Solid historical drama, but not particularly memorable for me. I found Barbie better. I also missed the first part of this film, which may have been a contributing factor."
  },
  "past-lives-2023": {
    "title": "Past Lives",
    "poster": "past-lives-2023.jpg",
    "year": 2023,
    "viewings": [
      {
        "date": "2023-11-04",
        "location": "Home"
      }
    ],
    "rating": 17,
    "comment": "Past Lives is a powerful and touching film with a lot of complex emotions portrayed through body language. It is semi-autobiographical and reminds us of how complicated real life can be compared to stories, especially with Arthur's character. Writing keys, phone, wallet next to the apartment door is relatable. The multiple eras in the film are presented well, though one of the scenes set in 2012 confused me because a featured vehicle didn't exist until several years later in reality."
  },
  "planes-trains-automobiles-1987": {
    "title": "Planes, Trains and Automobiles",
    "poster": "planes-trains-automobiles-1987.jpg",
    "year": 1987,
    "viewings": [
      {
        "date": "2021-11-26",
        "location": "Carl Becker House"
      }
    ],
    "rating": 15,
    "comment": "Planes, Trains and Automobiles is a classic American comedy from the 1980s and holds up well to this day. Many families have a tradition of watching it during the Thanksgiving holiday season."
  },
  "radical-2023": {
    "title": "Radical",
    "poster": "radical-2023.jpg",
    "year": 2023,
    "viewings": [
      {
        "date": "2023-11-19",
        "location": "AMC Highlands Ranch 24"
      }
    ],
    "rating": 17,
    "comment": "Based on a true story, Radical follows the lives of three students and how a new teacher transformed their school, one of the worst performing in Mexico. The stark contrast between life in Matamoros and just across the border in Texas emphasizes how inequality and lack of resources perpetuates cycles of violence and poverty, trapping children in the situations in which they were born. After the teacher's arrival, some students were able to reach their true potential and pursue their dreams of becoming aerospace engineers, but others were never able to escape."
  },
  "saving-private-ryan-1998": {
    "title": "Saving Private Ryan",
    "poster": "saving-private-ryan-1998.jpg",
    "year": 1998,
    "viewings": [
      {
        "date": "2023-10-17",
        "location": "Home"
      }
    ],
    "rating": 19,
    "comment": "Saving Private Ryan is an extremely powerful, gripping, and gruesome war film. The introductory battle scene leaves the viewer no breathing room from its intensity, and the moral footing of risking eight soldiers to save one is brought into question multiple times through the film. The former interpreter's lack of combat experience also shows and costs others their lives. Saving Private Ryan was selected for preservation in the US National Film Registry by the Library of Congress for its significance, and it's so understandable why."
  },
  "shang-chi-legend-ten-rings-2021": {
    "title": "Shang-Chi and the Legend of the Ten Rings",
    "poster": "shang-chi-legend-ten-rings-2021.jpg",
    "year": 2021,
    "viewings": [
      {
        "date": "2023-07-12",
        "location": "United Airlines"
      }
    ],
    "rating": 18,
    "comment": "Fourth superhero film watched in recent memory. I meant to watch it on another flight in the past but didn't for whatever reason. The family dynamics and characters felt deep and complex. Katy felt like someone I could have known in my life. The BMW product placement stuck out too much though. GM's in Barbie was much more natural."
  },
  "spider-man-no-way-home-2021": {
    "title": "Spider-Man: No Way Home",
    "poster": "spider-man-no-way-home-2021.jpg",
    "year": 2021,
    "viewings": [
      {
        "date": "2021-12-23",
        "location": "Landmark Greenwood Village"
      }
    ],
    "rating": 19,
    "comment": "This was the first superhero film that I had watched in maybe over five years. Spider-Man made me appreciate them much more and seek them out in the future. Tom Holland, Zendaya, and Jacob Batalon were great together. I didn't have much knowledge about the Spider-Man franchise going in, but was still able to enjoy the film a tremendous amount. The characters were very relatable."
  },
  "tampopo-1985": {
    "title": "Tampopo",
    "poster": "tampopo-1985.png",
    "year": 1985,
    "viewings": [
      {
        "date": "2022-07-21",
        "location": "SIFF Film Center"
      },
      {
        "date": "2022-11-07",
        "location": "Rockefeller Hall"
      }
    ],
    "rating": 20,
    "comment": "My first viewing of Tampopo was when a fellow intern rented out the SIFF Film Center to share his love of the film with everyone. Then I started to share the film with other people. The well-executed absurd comedy in Tampopo demonstrates how humor transcends both language and time."
  },
  "tar-2022": {
    "title": "Tár",
    "poster": "tar-2022.jpg",
    "year": 2022,
    "viewings": [
      {
        "date": "2023-09-07",
        "location": "Home"
      }
    ],
    "rating": 16,
    "comment": "I originally meant to watch Tár at Cornell Cinema in Spring 2023, but school got in the way. It is an engrossing drama about the musical world and some scenes stand out in particular, such as the masterclass at Juilliard and when she threatened a child. However, the introductory credits are really lengthy and made me bored before the main film even began. I also didn't really get the significance of the ending."
  },
  "taylor-swift-eras-tour-2023": {
    "title": "Taylor Swift: The Eras Tour",
    "poster": "taylor-swift-eras-tour-2023.jpg",
    "year": 2023,
    "viewings": [
      {
        "date": "2023-10-12",
        "location": "AMC Arapahoe Crossing 16"
      }
    ],
    "rating": 19,
    "comment": "Watched the Eras Tour film a day before the originally scheduled release in a mostly empty theater, which was a different experience than a stadium full of passionate fans for sure. Getting to watch the concert again with so many close up views let me notice a lot of details I didn't catch the first time around seeing it live. Some songs were cut for the film, but it was done cleanly. The CGI transitions between eras were good, especially the Reputation one. The film's not as immersive as the in-person concert, but how could it be? I do think that the film would have benefited from a higher framerate though, as it was hard to track elements on screen during certain shots."
  },
  "the-bridge-river-kwai-1957": {
    "title": "The Bridge on the River Kwai",
    "poster": "the-bridge-river-kwai-1957.jpg",
    "year": 1957,
    "viewings": [
      {
        "date": "2023-03-11",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 16,
    "comment": "The Bridge on the River Kwai is the oldest film I have seen in a while, and it felt that way. Fun to take at face value as an entertaining war movie, while also having more depth to it. Not completely historically accurate, but that's not unexpected."
  },
  "the-conformist-1970": {
    "title": "The Conformist",
    "poster": "the-conformist-1970.jpg",
    "year": 1970,
    "viewings": [
      {
        "date": "2023-03-18",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 17,
    "comment": "The Conformist (Il conformista) feels modern and classic at the same time. The architecture and visual style of the film create a fitting atmosphere for the time period. It's good."
  },
  "the-dictator-2012": {
    "title": "The Dictator",
    "poster": "the-dictator-2012.jpg",
    "year": 2012,
    "viewings": [
      {
        "date": "2022-06-19",
        "location": "Home"
      }
    ],
    "rating": 13,
    "comment": "The Dictator was reasonably funny and entertaining, but Borat 2 felt more topical when I watched it."
  },
  "the-fabelmans-2022": {
    "title": "The Fabelmans",
    "poster": "the-fabelmans-2022.jpg",
    "year": 2022,
    "viewings": [
      {
        "date": "2023-04-27",
        "location": "Cornell Cinema"
      }
    ],
    "rating": 15,
    "comment": "Nice semi-autobiographical coming of age story by Steven Spielberg. Cool to see America as he remembered it in the 1950s."
  },
  "the-imitation-game-2014": {
    "title": "The Imitation Game",
    "poster": "the-imitation-game-2014.jpg",
    "year": 2014,
    "viewings": [
      {
        "date": "2023-09-26",
        "location": "Home"
      }
    ],
    "rating": 17,
    "comment": "The Imitation Game surpassed my expectations when I watched it. The movie does a great job telling the (dramatized) story of a founder of modern computer science, Alan Turing, and the construction of the Bombe decryption device. When I took CS 3110 at Cornell, the first major assignment was to develop a software replica of the Enigma. The film is not historically accurate, but the creative liberties provide a more engaging story for the typical viewer that can be told in less than two hours."
  },
  "the-ministry-of-ungentlemanly-warfare-2024": {
    "title": "The Ministry of Ungentlemanly Warfare",
    "poster": "the-ministry-of-ungentlemanly-warfare-2024.jpg",
    "year": 2024,
    "viewings": [
      {
        "date": "2024-12-19",
        "location": "United Airlines"
      }
    ],
    "rating": 11,
    "comment": "Hadn't heard of this movie before when I watched it on the plane. The premise was interesting, but I didn't enjoy watching it. The story was fictionalized in a way that didn't connect with me. I found myself bored with the battle scenes that were supposed to be a highlight and wishing they would be over soon. The plot progressed quickly without much time given to character development."
  },
  "winters-bone-2010": {
    "title": "Winter's Bone",
    "poster": "winters-bone-2010.jpg",
    "year": 2010,
    "viewings": [
      {
        "date": "2024-01-17",
        "location": "Delta Air Lines"
      }
    ],
    "rating": 13,
    "comment": "Delta needs to add English subtitles to their in-flight entertainment. Winter's Bone is a fine movie, but I would not consider it a must-watch. It has Jennifer Lawrence before The Hunger Games. Interesting to see a rural area of Missouri with poverty, distant family, and news spreading through small communities. The later part quickly went from normal to WTF."
  },
  "wonka-2023": {
    "title": "Wonka",
    "poster": "wonka-2023.jpg",
    "year": 2023,
    "viewings": [
      {
        "date": "2024-01-04",
        "location": "Regal SouthGlenn"
      }
    ],
    "rating": 15,
    "comment": "Wonka is a fun musical fantasy film. Though there were lots of twists and turns, there's never really any doubt that everything will work out fine in the end. The beginning was a little strange and it felt like it took some time to get going. There are deeper themes available, but they didn't strike me as being super complex. I appreciated that the ending wrapped up many subplots and set the stage for the other movies."
  },
  "zootopia-2016": {
    "title": "Zootopia",
    "poster": "zootopia-2016.jpg",
    "year": 2016,
    "viewings": [
      {
        "date": "2025-12-17",
        "location": "Alaska Airlines"
      }
    ],
    "rating": 15,
    "comment": "Zootopia is a solid animated film with a nice number of twists and a satisfying ending. Like similar films it teaches kids a good life lesson, this time about breaking stereotypes and challenging prejudice. But I feel like it's aged poorly, especially since 2020 and the public discourse over police brutality, and I didn't find it that personally impactful."
  }
}
